; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	thermograph3 - mode
	spectrograph7 - mode
	image2 - mode
	spectrograph1 - mode
	infrared0 - mode
	spectrograph8 - mode
	spectrograph4 - mode
	image6 - mode
	image5 - mode
	Star5 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation4 - direction
	Star3 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph3)
	(supports instrument0 image6)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star3)
	(supports instrument1 image6)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph7)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image5)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph8)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 image5)
	(supports instrument4 spectrograph7)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(pointing satellite1 Phenomenon8)
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon6 spectrograph8)
	(have_image Planet7 thermograph3)
	(have_image Phenomenon8 spectrograph7)
	(have_image Phenomenon8 spectrograph4)
	(have_image Phenomenon8 thermograph3)
	(have_image Phenomenon9 spectrograph1)
	(have_image Star10 image6)
	(have_image Star10 image5)
))

)

; plan
1. (turn_to satellite1 groundstation4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 11
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite0 star10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star10)
   goals met: 0 of 11
5. (take_image satellite0 star10 instrument1 image6)
   added: (have_image star10 image6)
   goals met: 1 of 11
6. (turn_to satellite0 phenomenon8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 11
7. (take_image satellite0 phenomenon8 instrument1 spectrograph7)
   added: (have_image phenomenon8 spectrograph7)
   goals met: 3 of 11
8. (take_image satellite0 phenomenon8 instrument1 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 4 of 11
9. (turn_to satellite0 star1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star1)
   goals met: 3 of 11
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 11
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 11
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 11
13. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 3 of 11
14. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 3 of 11
15. (turn_to satellite0 phenomenon6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 11
16. (take_image satellite0 phenomenon6 instrument2 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 4 of 11
17. (take_image satellite0 phenomenon6 instrument2 spectrograph8)
   added: (have_image phenomenon6 spectrograph8)
   goals met: 5 of 11
18. (turn_to satellite0 star10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star10)
   goals met: 5 of 11
19. (take_image satellite0 star10 instrument2 image5)
   added: (have_image star10 image5)
   goals met: 6 of 11
20. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 6 of 11
21. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 11
22. (turn_to satellite0 groundstation0 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation0)
   goals met: 6 of 11
23. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 6 of 11
24. (turn_to satellite0 planet7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet7)
   goals met: 6 of 11
25. (take_image satellite0 planet7 instrument0 thermograph3)
   added: (have_image planet7 thermograph3)
   goals met: 7 of 11
26. (turn_to satellite0 phenomenon8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon8)
   goals met: 8 of 11
27. (take_image satellite0 phenomenon8 instrument0 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 9 of 11
28. (turn_to satellite1 phenomenon9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon9)
   goals met: 9 of 11
29. (take_image satellite1 phenomenon9 instrument3 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 10 of 11
30. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 11 of 11
